package com.itvdn.homework.javaessential.lesson3.task2;

public class ClassRoom {

    public ClassRoom(Pupil pupil) {
        pupil.study();
        pupil.read();
        pupil.write();
        pupil.relax();
    }
}

//        Задание 2
//        Используя IntelliJ IDEA, создайте проект.
//        Требуется:
//        Создать класс, представляющий учебный класс ClassRoom.
//
//        Создайте класс ученик Pupil. В теле класса создайте методы void study(), void read(), void write(),
//        void relax(). Создайте 3 производных класса ExcelentPupil, GoodPupil, BadPupil
//        от класса базового класса Pupil и переопределите каждый из методов, в зависимости от успеваемости ученика.
//        Конструктор класса ClassRoom принимает аргументы типа Pupil, класс должен состоять из 4 учеников.
//        Предусмотрите возможность того, что пользователь может передать 2 или 3 аргумента.
//        Выведите информацию о том, как все ученики экземпляра класса ClassRoom умеют
//        учиться, читать, писать, отдыхать.


//        Задание 5
//        Зайдите на сайт Oracle.
//        Используя поисковые механизмы Oracle, найдите самостоятельно описание темы по каждому примеру,
//        который был рассмотрен на уроке, так, как это представлено ниже, в разделе «Рекомендуемые ресурсы»,
//        описания данного урока.
//        Сохраните ссылки и дайте им короткое описание.
