package com.itvdn.homework.javaessential.lesson8.task3;

public class Price {

}

//TODO        Задание 3
//        Создайте проект, используя IntelliJ IDEA.

//        Требуется: Описать класс с именем Price, содержащую следующие поля:
//        - название товара;
//        - название магазина, в котором продается товар;
//        - стоимость товара в гривнах.
//        Написать программу, выполняющую следующие действия:
//        - ввод с клавиатуры данных в массив, состоящий из двух элементов типа Price
//        (записи должны быть упорядочены в алфавитном порядке по названиям магазинов);
//        вывод на экран информации о товарах, продающихся в магазине, название которого введено
//        с клавиатуры (если такого магазина нет, вывести исключение).