package com.itvdn.homework.javaessential.lesson4.task2;

public class AbstractHandler {
}

//        Задание 2
//        Используя IntelliJ IDEA, создайте проект.Требуется:
//        Создайте класс AbstractHandler.
//        В теле класса создать методы void open(), void create(), void change(), void save().
//        Создать производные классы XMLHandler, TXTHandler, DOCHandler от базового класса AbstractHandler.
//        Написать программу, которая будет выполнять определение документа и для каждого формата должны
//        быть методы открытия, создания, редактирования, сохранения определенного формата документа.



//        Задание 4
//        Зайдите на сайт Oracle.
//        Используя поисковые механизмы Oracle, найдите самостоятельно описание темы по каждому примеру, который был рассмотрен на уроке, так, как это представлено ниже, в разделе «Рекомендуемые ресурсы», описания данного урока. Сохраните ссылки и дайте им короткое описание.
