package com.itvdn.homework.javaessential.lesson8.task2;

public class Worker {

    private String surname;
    private String initials;
    private String position;
    private int yearOfHiring;


}
//TODO
//        Задание 2
//        Создайте проект, используя IntelliJ IDEA. Требуется:
//        Описать класс с именем Worker, содержащую следующие поля:
//        - фамилия и инициалы работника;
//        - название занимаемой должности;
//        - год поступления на работу.
//
//        Написать программу, выполняющую следующие действия:
//        - ввод с клавиатуры данных в массив, состоящий из пяти элементов типа Worker
//        (записи должны быть упорядочены по алфавиту);
//        - если значение года введено не в соответствующем формате выдает исключение.
//        - вывод на экран фамилии работника, стаж работы которого превышает введенное значение.


